#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
/*
int main()
{
	int i = 0, a = 0, b = 2, c = 3, d = 4; 
	//int i = 0, a = 1, b = 2, c = 3, d = 4;  
	//i = a++ && ++b && d++;
	//a = 0  ->  运行结果：1 2 3 4  ->因为a=0，所以不会进行后面的程序
	//a = 1  ->  运行结果：运行结果：2 3 3 5

	i = a++||++b||d++;
	//a = 1  ->  运行结果： 2 2 3 4 
	printf("a=%d\n b=%d\n c=%d\n d=%d\n", a, b, c, d);
	return 0;
}//如果是&&，左边为假，不需要再算； 如果是||，左边为真，不需要再算
*/

/*
//三目操作符
int main()
{
	int a = 0;
	int b = 0;
	int max = 0;
	if (a > b)
		max = a;
	else
		max = b;

	max = (a > b ? a : b);


	if (a > 5)
	{
		b = 3;
	}
	else
		b = -3;
	//转换成三目操作符
	b = (a > 5 ? 3 : -3);

	return 0;
}
*/

//逗号表达式，从左到右依次执行，整个表达式的结果是最后一个表达式的结果
/*
int get_max(int x, int y)
{
	return x > y ? x : y;
}

int main()
{
	int a = 10;
	int b = 20;
	//调用函数的时候的（）就是函数调用操作符
	int max = get_max(a, b);
	printf("%d\n", max);
	return 0;
}
*/


////创建一个结构体类型 - struct Stu
//struct Stu
//{
//	//成员变量
//	char name[20];
//	int age;
//	char id[20];
//};
//
//int main()
//{
//	int a = 10;
//	//使用struct Stu 这个类型创建了一个学生s1，并初始化
//	struct Stu s1 = { "张三", 20, "2021030306" };
//	struct Stu* ps = &s1;
//
//	//printf("%s\n", (*ps).name);
//	printf("%s\n", ps->name);//  '->' 是结构体指针操作符  ； 结构体指针 -> 成员名
//
//	//printf("%d\n", (*ps).age);
//	printf("%d\n", ps->age);
//
//	/*printf("%s\n", s1.name);
//	printf("%d\n", s1.age);
//	printf("%s\n", s1.id);*/  // ‘ . ’ 操作符用来访问结构体成员  ->  结构体变量.成员名
//	return 0;
//}



//整形提升是按照变量的数据类型的符号位来提升的
/*
int main()
{
	char a = 3; //a是一个字节，只能存放8个比特位，这时会发生截断，挑最小最低的一个字节存放
	//00000000000000000000000000000011
	//00000011 - 1
	char b = 127;
	//00000000000000000000000001111111
	//01111111 - b
	
	//a和b如何相加
	//进行整形提升
	//00000000000000000000000000000011
	//00000000000000000000000001111111
	//00000000000000000000000010000010
	char c = a + b;
	//100000010-c
	//11111111111111111111111100000010 - 补码
	//11111111111111111111111100000001 - 反码
	//10000000000000000000000011111110 - 原码
	//-126
	printf("%d\n", c);

	return 0;
}

//负数的整形提升
char c1 = -1;
//变量c1的二进制位（补码）中只有8个比特位；
//1111111
//因为char为有符号的char
//所以整形提升的时候，高位补充符号位，即为1
//提升之后的结果是：
//11111111111111111111111111111111

//正数的整形提升
char c2 = 1;
//变量c2的二进制位（补码）中只有8个比特位：
//00000001
//因为char为有符号的char
//所以整形提升的时候，高位补充符号位，即为0
//提升之后的结果是：
//00000000000000000000000000000001

//无符号整形提升，高位补0

*/
/*
int main()
{
	char a = 0xb6;
	short b = 0xb600;
	int c = 0xb6000000;
	if (a == 0xb6)
		printf("a");
	if (b == 0xb600)
		printf("b");
	if (c == 0xb6000000)
		printf("c");
	return 0;
}
*/
int main()
{
	char c = 1;
	printf("%u\n",sizeof(c));
	printf("%u\n",sizeof(+c));
	printf("%u\n",sizeof(!c));
	return 0;
}
//字符型或者短整型只要参与表达式运算就会发生整形提升