#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//移位操作符
//只能作用于整数；不能用于浮点数
//警告：对于移位运算符，不要移动负数位，这个是标准未定义的
//例如；  num >> -1;  //error


//int main()
//{
//	int a = 16;
//	//>>--右移操作符
//	//移动的是二进制位
//	//00000000000000000000000000010000
//	/*右操作符
//	1. 算术右移
//	右边丢弃，左边补原符号位（正数符号位为：0   ； 负数符号位为：1）
//	2. 算数右移
//	右边丢弃，左边补0
//	*/
//	int b = a >> 1; //右移一位
//	printf("%d\n", b);
//	return 0;
//}

/*
int main()
{
	int a = -1;
	//整数的二进制表示有：原码、反码、补码
	//存储到内存的是补码
	//1000000000000000000000000000000000000001-原码
	//1111111111111111111111111111111111111110-反码（符号位不变，按位取反）
	//1111111111111111111111111111111111111111-补码（反码加1）
	int b = a >> 1; //右移一位
	printf("%d\n", b);
	return 0;
}*/

/*
int main()
{
	int a = 5;
	int b = a << 1;
	//00000000000000000000000000000101
	//左移操作符
	//左边丢弃，右边补0
	printf("%d\n", b);  //结果为10
	return 0;
}
*/

//按2进制位异或 : ^
//相同为0；相异为1


//面试题：不能创建临时变量（第三个变量），实现两个数的交换
//
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//int tmp = 0;//临时变量
//	printf("before: a=%d b=%d\n", a, b);
//	/*tmp = a;
//	a = b;
//	b = tmp;*/
//	
//	//加减法
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/
//
//	//异或法
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//
//	printf("after: a=%d b=%d\n", a, b);
//
//	return 0;
//}


//编写代码实现：求一个整数储存在内存中的二进制中1的个数
/*
下面的方法只能判断正整数储存在内存中的二进制中1的个数
int main()
{
	int num = 0;
	int count = 0;
	scanf("%d", &num);

	while (num)
	{
		if (num % 2 == 1)
		{
			count++;
			num /= 2;
		}

	}
	printf("二进制中1的个数=%d\n", count);

	return 0;
}

可以实现的代码
int main()
{
	int num = 0;
	int count = 0;
	scanf("%d", &num);

	for (int i = 0; i < 32; i++)
	{
		if (1 == ((num >> i) & 1))
			count++;
	}
	printf("%d", count);

	return 0;
}

//这里必须循环32次，思考还能不能更加优化

//上述方法进行优化的结果
int main()
{
	int num = -1;
	int i = 0;
	int count = 0;
	scanf("%d", &num);

	while (num)
	{
		count++;
		num = num & (num - 1);
	}
	printf("%d", count);
	return 0;
}
*/


//复合赋值符
//  +=    -=    *=    /=     %=    >>=   <<=   &=   |=    ^=

//单目操作符
/*
int main()
{
	int a = 10;
	int* p = &a;  //& ：取地址操作符
	*p = 20;     //* ：解引用操作符
	return 0;
}
*/


/**/
int main()
{
	int a = 0;
	//~： 按（二进制）位取反
	//00000000000000000000000000000000 - 对他进行按位取反也就是他的补码
	//11111111111111111111111111111111 - 补码
	//11111111111111111111111111111110 - 反码
	//10000000000000000000000000000001 - 原码  （符号位不变，取反）
	//-1
	printf("%d\n", ~a); //按位取反  这里打印的是原码
	return 0;
}

int main()
{
	int a = 11;
	a = a | (1 << 2);
	printf("%d\n", a);
	//00000000000000000000000000001011  - 把第三位0变成1
	//00000000000000000000000000000100
	//1<<2
	//00000000000000000000000000000001

	//00000000000000000000000000001111  - 把第三位1变成0
	//11111111111111111111111111111011  - 与上这个就可以
	//00000000000000000000000000000100  - 1 << 2取反就是上面
	//00000000000000000000000000001011  - 最后的结果
	a = a & (~(1 << 2));
	printf("%d\n", a);
	return 0;
}

//++a: 前置++，先++，后使用
//a++：后置++，先使用，后++